In [1]:
import csv 
import sqlite3

from datetime import datetime

In [3]:
import pandas as pd

df = pd.read_csv('openweathermap_01012010_09212020.csv', delimiter='\t')

In [32]:
df.head()

  dt,dt_iso,timezone,city_name,lat,lon,temp,feels_like,temp_min,temp_max,pressure,sea_level,grnd_level,humidity,wind_speed,wind_deg,rain_1h,rain_3h,snow_1h,snow_3h,clouds_all,weather_id,weather_main,weather_description,weather_icon
0  1262304000,2010-01-01 00:00:00 +0000 UTC,-1800...
1  1262307600,2010-01-01 01:00:00 +0000 UTC,-1800...
2  1262311200,2010-01-01 02:00:00 +0000 UTC,-1800...
3  1262311200,2010-01-01 02:00:00 +0000 UTC,-1800...
4  1262314800,2010-01-01 03:00:00 +0000 UTC,-1800...

In [33]:
header = "dt,dt_iso,timezone,city_name,lat,lon,temp,feels_like,temp_min,temp_max,pressure,sea_level,grnd_level,humidity,wind_speed,wind_deg,rain_1h,rain_3h,snow_1h,snow_3h,clouds_all,weather_id,weather_main,weather_description,weather_icon"
for col in header.split(","):
    print(col)

dt
dt_iso
timezone
city_name
lat
lon
temp
feels_like
temp_min
temp_max
pressure
sea_level
grnd_level
humidity
wind_speed
wind_deg
rain_1h
rain_3h
snow_1h
snow_3h
clouds_all
weather_id
weather_main
weather_description
weather_icon

In [41]:
SCHEMA = """
CREATE TABLE IF NOT EXISTS weather (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    dt VARCHAR(255),
    dt_iso VARCHAR(255),
    timezone VARCHAR(255),
    city_name VARCHAR(255),
    lat FLOAT,
    lon FLOAT,
    temp FLOAT,
    feels_like FLOAT,
    temp_min FLOAT,
    temp_max FLOAT,
    pressure FLOAT,
    sea_level VARCHAR(255),
    grnd_level VARCHAR(255),
    humidity VARCHAR(255),
    wind_speed FLOAT,
    wind_deg FLOAT,
    rain_1h FLOAT,
    rain_3h FLOAT,
    snow_1h FLOAT,
    snow_3h FLOAT,
    clouds_all VARCHAR(255),
    weather_id INTEGER,
    weather_main VARCHAR(255),
    weather_description VARCHAR(255),
    weather_icon VARCHAR(255),
    UNIQUE(id)
)"""

In [35]:
df = pd.read_csv('openweathermap_01012010_09212020.csv', delimiter=",")
df.head()

,dt,dt_iso,timezone,city_name,lat,lon,temp,feels_like,temp_min,temp_max,...,wind_deg,rain_1h,rain_3h,snow_1h,snow_3h,clouds_all,weather_id,weather_main,weather_description,weather_icon
0,1262304000,2010-01-01 00:00:00 +0000 UTC,-18000,Washington,38.907192,-77.036871,35.22,30.97,33.80,35.96,...,117,0.4,NaN,NaN,NaN,100,500,Rain,light rain,10n
1,1262307600,2010-01-01 01:00:00 +0000 UTC,-18000,Washington,38.907192,-77.036871,35.15,30.52,33.80,36.11,...,160,0.3,NaN,NaN,NaN,100,500,Rain,light rain,10n
2,1262311200,2010-01-01 02:00:00 +0000 UTC,-18000,Washington,38.907192,-77.036871,35.24,30.76,33.62,36.32,...,45,1.3,NaN,0.8,NaN,100,501,Rain,moderate rain,10n
3,1262311200,2010-01-01 02:00:00 +0000 UTC,-18000,Washington,38.907192,-77.036871,35.24,30.76,33.62,36.32,...,45,1.3,NaN,0.8,NaN,100,601,Snow,snow,13n
4,1262314800,2010-01-01 03:00:00 +0000 UTC,-18000,Washington,38.907192,-77.036871,35.35,30.83,33.80,36.77,...,60,NaN,3.0,0.5,1.5,100,500,Rain,light rain,10n

In [46]:
conn = sqlite3.connect("dc_historical_weather.db")

In [45]:
#SCHEMA = """DROP TABLE weather"""

In [47]:
cur = conn.cursor()
cur.execute(SCHEMA)

In [48]:
df.to_sql('weather', conn, if_exists='append', index=False)
conn.commit()
conn.close()

In [73]:
#January 2019 average temp
def sum_usage():
    cur = conn.cursor()
    cur.execute("SELECT (SUM(temp_min + temp_max)/2)/(31*24) FROM weather WHERE dt >=1546300800 AND dt <=1548935999")
    return cur.fetchall()

sum_usage()

[(35.48797043010746,)]